{
    "review0": {
        "metadata": {
            "Review_Title": "No beeping alerts",
            "Rating": 1.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " On my trip to Maui I rented this van to drive to see if I would buy one in the future.    The handling and acceleration was decent for the  van with 4 kids.  It was my second day and was still driving it around and enjoying my vacation.    Was not aware of all the functions on the key controls.   Just lock and unlock.  I must have accidentally hit the open truck key and was not aware of it beenopen.  There was no beeping sound or flashing alert on the dash like my Toyota van.  I drove the car out of the car port and the trunk window got shattered because it was to high.   I believe this to be a design default.    My lost"
    },
    "review1": {
        "metadata": {
            "Review_Title": "Biggest let down ever.",
            "Rating": 1.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " We bought it brand new and have had a misfire since about the first month.( they cant find it.) Also siding door rattles at times. And if sitting idling in gear with running lights or what is called driving light which are automatically on they will flicker continuously. ( another thing they cant find). Fuel mileage is nothing like advertising says. Ours doing the math miles driven vrs gallons used will alot of the times be 16 to 17. Never seen it even close to what the dash says. 25.xx miles per gallon. Yes they will warranty it but they keep telling us its normal operations. My advice dont buy one. Ours has been and still is nothing but a major headache and disappointment."
    },
    "review2": {
        "metadata": {
            "Review_Title": "New 2017 Grand Caravan surges and hesitates",
            "Rating": 1.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I bought this 2017 Grand Caravan brand new with only 15 miles, day one I noticed the engine missing while running in park, when at stop with foot on brake it has a surge in the engine, while driving it has a miss in the engine and surges like the transmission is starting to slip.  Took to dealer and was told they had to update the computer and was also told to NEVER use E85 even-though it is rated to use it, I told them that I had never used the E85 and was only using premium gas, I was then told that premium gas was as bad as E85 and causes the computer to act up. I was told to only use regular unleaded fuel and in a couple of tanks it should work itself out, well three tanks later is is not as bad as it was but it still acts up almost daily. What a POS, I have always been a Dodge Guy but wish I hadn't bought this one. Only getting 13 mpg in city and 19 or 20 on highway and I only have about 2,100 miles on it (yes that is actually 2,100 miles), I am about to trade it in on a Chevy or Ford..................................................."
    },
    "review3": {
        "metadata": {
            "Review_Title": "2017 Dodge Charger Daytona NAVIGATION ISSUES",
            "Rating": 1.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I bought a brand new 2017 Dodge Charger Daytona and the navigation does not pronounce the street name correctly. Example in video for NE 21st says Nebraska (I live in Oregon) because the street direction NE is the state abreviation for Nebraska. Been working with Dodge and the dealership for the past 3 months with no resolution. This happens with any street that is NE or SE followed by a number address. Dodge tells me there is NO fix. I drove other chargers including 2018 and they all do the same thing. The entire panasonic nav is faulty and I paid for navigation that does not work! I am a Realtor and use nav daily and am very unhappy Dodge cant find a fix and has told me I am out of luck. Also they are selling all cars with faulty navigation without disclosing to potential buyers of this uncorrectable fix. Wondered if anyone else is having this issue with Nav and if your dealership is doing anything about it?"
    },
    "review4": {
        "metadata": {
            "Review_Title": "Not Enough Stow N Go or Milage",
            "Rating": 3.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I was asked why we decided not to purchase the 2017 Dodge Caravan (Base Model). While the wife loved it, I found fault with the mid-row seats that did NOT Stow N Go (a feature that drew us to look at Caravans. We actually looked at and drove a new 2016 that was priced around 20K 'out the door.'I also found the gas mileage a bit disappointing - apparently these minivans are larger and heavier than I thought. Replacing our Hyundai sedan would have significantly increased our operating costs.  And, of course, you never get the the mileage shown on the stickers!"
    },
    "review5": {
        "metadata": {
            "Review_Title": "Love it but will never buy it",
            "Rating": 3.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " This is my favorite car. Classic American muscle. However I won't be buying one since there is no CD player. I have over 3,000 cds! This car has a great design and concept but again Chrysler ruins it by trying to be cheap."
    },
    "review6": {
        "metadata": {
            "Review_Title": "A week in Northern California",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " My wife and I reserved a \"premium car\" (meaning full-size) with Alamo for our trip in Northern California.  When we got on the lot our choices were an Impala, a Lacrosse, and the Charger.  I was leaning towards the Lacrosse as it appeared to be trimmed nicer with a leather package.  My wife, however was drawn to the Charger's looks.  She was right -- even just being the STX, it did have a commanding presence, and from what I had heard, I figured the V6 power and the Charger's handling might be better on the curvy and mountainous roads we would be traveling on -- so we went with the Charger.  First off, getting situated was fine -- the trunk was very spacious, I easily paired my phone to the Bluetooth for music and gps, and we both got comfortably situated in our seats.  My first complaint, however, was that there was no back-up camera -- how does a full size car with not the greatest rear-view vision not have this as standard equipment in this modern era? In driving from the Oakland airport to Napa Valley, and around Napa Valley, the car functioned as expected, and I was pleased (except for the lack of the rear-view camera).  The next stage of our trip led us further north, to the Redwoods, including some travelling through very curvy roads and in the mountains.  Here the Charger fell short of my expectations.  I should state, my regular car is an Optima SX Turbo -- and while it is no true performance car, it does well, and is fun to drive in such situations.  The Charger, on the other hand, did not quite have the acceleration I am accustomed to, nor the tighter handling around the curves (granted, it is bigger than my Optima).  It drove more like the traditional full size cars I'd driven, and less like the sporty Charger I expected (perhaps that handling is there on the pricier V8 trims).  Still, all in all, it was not bad -- I've driven much worse in similar situations.  We drove the car for over a week and more that 1000 miles, and up until near the end we were for the most part happy with the car.  But the day before we returned the car, the Bluetooth stopped working -- we spent a good amount of time and several ideas trying to resolve the problem, but nothing would work -- very frustrating."
    },
    "review7": {
        "metadata": {
            "Review_Title": "come back of the America muscle car",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Is a great car, fast and furious...for sure...just love it...Thank you Off lease-Orlando...Thank you S. Hackett, Vince and Shany...you are a great team..."
    },
    "review8": {
        "metadata": {
            "Review_Title": "Mexican Hemi, Mexican Transmission, Made in Canada",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I was getting my American built Ram 4x4 serviced on another Factory Recall so I had some time to test drive a new Challenger T/A 392 (6.4 Hemi) 6 Speed Manual.  Cloth type fabric seats were ok but non-ventilated and lacking the overall comfort of the leather or suede seats other Challengers have.  Front A Pillars will challenge you to 'see' in front of you.  Backing up is all but impossible without the Back Up Camera on the 8.4 Screen.  The overall performance was as expected and put a smile on my face.  Clutch force was agreeable with my old knees.  Excellent Electronics and Nav. I guess the ONLY real issue I have with this All American Muscle Car Icon is that the Engine and Transmissions are Made in Mexico.  Then, because of NAFTA, Fiat gets to ship them to Canada where the Challenger is assembled and then shipped to America for $1,047 that the Consumer has to pay.  My Ram 4x4 was made in America with a Hemi Engine but American Transmission and drive train BEFORE Fiat took over Chrysler.  So, FIAT now owns Chrysler/Dodge/Ram/Jeep and builds them between Mexico and Canada (some in America) and sells them here in America for $49,757 before tax, tag, and title...  No thanks...I hope President Trump pulls us out of NAFTA.  God Bless American Jobs and American Workers."
    },
    "review9": {
        "metadata": {
            "Review_Title": "Review of 2017 Dodge Grand Caravan SXT",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " This midsized minivan is meant to be on the sportier side. With a 3.6 L V6 that allows flex fuel as well as normal fuel, this van can really go if you give it the right amount of power, although the engine has a bit of a lag at first. The startup is fairly quiet, but running vibrations while the van is in the park gear can annoying. The location gear shifter is a bit odd, but the dashboard is straightforward. Good local car, but lacks entertainment feature that would make long rod trips pleasant. Mileage is about 17 in the city and 24 on the highway. A fuel economy mode is available on certain models."
    },
    "review10": {
        "metadata": {
            "Review_Title": "My first flirtation with Dodge.....",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I have always promised myself I would never own a Dodge due to pain and trouble a 78 Dodge power wagon 4x4 that my parents owned when I was growing up put us all through. That truck caused me to have to walk no less than 50 miles in my life due to break downs, so when I grew up I promised myself that I would never own a Dodge until I saw the Hellcat and did a test drive in own, unfortunately I had to let the salesman know that there was no way that I could possibly buy the Hellcat as if I did I would be arrested within 4 hours for excessive speeding, or worse. So he introduced me to the 2017 Scat pack, not quite the Hellcat but she can get the job done when I want her to, there are issues like Dodge not releasing parts for it so I can add the remote starter and the 4g internet, I am about to file a lemon law claim against Dodge based upon that issue."
    },
    "review11": {
        "metadata": {
            "Review_Title": "great mileage for a car this fast",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Rented this car for a trip to Vegas.  V6 basic car.  First impressions were very touchy brakes but you get used to it.  Power for passing on 2 lanes very good.  Handling very good even on worn stock tires.  Gas mileage was way better than I expected.  Whole tank netted 35+ mpg at legal and above speeds on 2 lane roads thru desert over 2 mountain passes and thru one town rush hour.  Just as a test from state line to downtown Vegas, pulled to slow lane on I-15, set cruise to 70, and netted 45 mpg for 40 miles.  For other reviews about this car complaining about mileage, drive sensibly, anticipate slow downs and red lights and don't buy low profile, wide wheels and tires.  Other comments are rather cheap looking instrument panel.  Readouts on computer lettering could be larger.  Only power cord outlet in console cubby.  Makes for a long power cord stretch for my Garmin in left corner windshield.  My recommendation for a daily driver and long trips, buy a base V6, upgrade to nicer seats with more power adjustments and go for a back-up camera."
    },
    "review12": {
        "metadata": {
            "Review_Title": "It's a '68/'69 Camaro on steroids",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I've wanted a '68 Z-28 since then. When the '08 Challenger body style appeared, I noticed. When the '12 body updates occurred, I had to get one. The wait was absolutely worth it. Simply gorgeous/brutal looks, active exhaust sounds killer, acceleration (375 hp) is something else. Huge moon roof. Six-speed stick feels great in the hand, and works fine. Gas mileage: forget it. Handling: forget it. Rear visibility: forget it. But a trunk (with fold-down rear seats) for the ages, even with the OPTIONAL ($300) spare tire.  Dwarfs WRXs, BMWs; same size as a Cadillac CTS. At 4400 lbs, it ain't lithe. If you want handling, buy an angular Camaro or a humdrum Mustang. If you want the ultimate evolution of the classic '60's muscle car, with a sound and straightline pull that will get your attention, buy a Challenger."
    },
    "review13": {
        "metadata": {
            "Review_Title": "Bluetooth",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Bluetooth not standard and expensive to install. Should be standard equipment uconnect has capacity to do things but not friendly"
    },
    "review14": {
        "metadata": {
            "Review_Title": "Love it after 5000 mile camper trip",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " These vans do what they are meant to do, carry lots of stuff or people.  We just finished 5000 mile trip in the Rocky Mountains and our 2016 Dodge Grand Caravan SXT was great.  It pulled a pop up camper up and down mountains  without a complaint and got great mileage doing it.  We had hoped for 20 mpg and got 24mpg(actually 23.7) traveling with the traffic at highway speeds.  Now without the trailer mileage approaches/exceeds 30mpg at highway speeds.  And our two dogs love it too.  We buy and keep our cars for long periods and have always had great performance from Dodge grand caravans."
    },
    "review15": {
        "metadata": {
            "Review_Title": "Bring Back Hood Mounted Directional Indicators",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " My Challenger has been great - though I must confess that I only drive it for recreation.  I have no complaints except to say that there are gives and gets with such a sleek body style...and you have to take the bad with the good.  My only suggestion is to please reintroduce something that's been missing for years from Dodge muscle cars - namely, the hood mounted directional signals.  Yes, i know, they were a styling feature on the charger, but they made these cars so distinctively Dodge that they are always sought-after by buyers of old Chargers   First, are they intact, and second....do they still work?  Agreed, this feature adds nothing to the functionality or safety of the vehicle (similar to sequential directional signals offered by Ford), but they're so darn cool...and so darn Mopar!   I swear, if they were offered on new Challengers, I'd trade my 2014 in on a new one.  How shallow and immature is that?  But then again, isn't that what's it's all about?"
    },
    "review16": {
        "metadata": {
            "Review_Title": "Daytona Charger review",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Beautiful car, sounds amazing but the 5.7 lacks power, go for the 392 version. It isn’t that much more expensive."
    },
    "review17": {
        "metadata": {
            "Review_Title": "A comfortable sedan with a lot of attitude",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Note: I have an R/T (5.7L), not a Scat Pack. I'm not sure why that was selected for my review. I'm a 40-something-year-old dad with teenaged kids. I've been driving an Avalanche for the past 6 years and it's served me well. But I wanted to move back to a car rather than a truck. I knew I wanted a big sedan. I had been looking at Chargers for a long time. Everything else in its class seemed kind of bland. I had never owned a Dodge product but I really liked the styling of the new Chargers, and the availability of a V8 made them that more interesting. A couple of months ago, one of my other cars went into the dealer for a recall. They sent me to Enterprise for a complimentary rental. Enterprise picked me up in what I would learn was a 2017 Charger. I got into the passenger side and the woman from Enterprise started it up. The exhaust growl got my attention immediately. I asked her what exactly this thing was - it was an R/T. Sadly, this was not to be my rental car. But they did give me a 2017 AWD Charger with the 3.6L VVT engine. After driving that for a few weeks, I was hooked. I'm going to preface the rest of my comments by reminding you that we're talking about a full-sized sedan. Acceleration was great, handling was precise and braking was awesome. Cabin space is generous and the seats are comfortable. The UConnect system is intuitive and comprehensive. After turning my rental in, I was on the hunt for a 2017 R/T. The color had to be Maximum Steel Metallic and it had to have the Blacktop package. I found one a couple of weeks later and have owned it a couple of weeks now. The 5.7L Hemi vs. the 3.6L VVT experience is night and day. The active exhaust on the R/T is sophisticated and sounds sweet. The 8-speed transmission behaves totally different behind the 5.7L vs. the 3.6L. In both cases, however, shifts are smooth and quick. The Android Auto feature baked into the UConnect is nice. I haven't tried the Apple version. The car I bought has very few options, but that's the way I like it. As equipped - just the R/T package and Blacktop option - it does everything I want it to do. It can be a docile 4 cylinder when commuting to work, or you can push the Sport button and let it rumble. Now the cons...there are a few things that my Avalanche does that the Charger does not. First, the ability to program the passenger seat heater to come on with a remote start. Charger doesn't do that. The Charger does not dip the right-side mirror when backing either, which is a nice feature that other cars have. My only other complaint is that the factory Firestone Firehawk GT tires really suck in cold weather. They're marketed as an all season tire but they are totally ineffective in the cold and snow. I've owned A LOT of V8, RWD cars over the years and have driven them in the Winter without issue. This Charger is completely helpless in inclement weather and I blame the tires. I'll be investing in dedicated Winter tires next season."
    },
    "review18": {
        "metadata": {
            "Review_Title": "It's decent",
            "Rating": 4.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I like it enough.  Wish I had an 18 with the bells and whistles."
    },
    "review19": {
        "metadata": {
            "Review_Title": "Family Friendly Muscle Car",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Moving up from a Subaru BRZ, the car is ultra comfortable for me.  Easy in and out.  The family finds it a great car to travel in.  I find its a fun car to drive.  It certainly is capable of scratching the acceleration itch that comes along now and again.  Stay off the pedal and I am getting a respectable 28 - 30 mpg at a cruise of 70.  Mixed driving is 23 - 24.  Technology it is the bomb.  The connect system is quick and responsive and very well laid out.  Apple Car play functions very well and my daughter is happy she has USB ports in the back seat as well as an A/C vent.  Overall I find the car an excellent blend of family functionality and a car that provides some fun behind the wheel."
    },
    "review20": {
        "metadata": {
            "Review_Title": "Great choice!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I've wanted a Challenger since they were first brought back. Finally bought my dream car last year after earning a promotion. I went to many many dealerships and took my time and was not disappointed with being picky. I got the last new 2017 bare bones R/T Super Track Pak in the south I'm pretty sure. Definitely get a V8 if you actually want to enjoy the drive, the V6 will never compare. Gas mileage in actual practice is lower than it was projected with factory setup. Car will feel slippery in the cold but that's because they decided to put 245s on them, definitely upgrade ASAP."
    },
    "review21": {
        "metadata": {
            "Review_Title": "It's been a long time",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " A great ride ,easier for me to get in or out ( only thing  I would suggest is some type of door handle pull ) . I like the 20\" tires for ride & extra high clearance in driveway ."
    },
    "review22": {
        "metadata": {
            "Review_Title": "Dream come true",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I went in expecting to only be able to afford the Daytona with the 5.7 or the Scat Pack.  I was floored when I found out I could get the Daytona 392 for less than another dealership was trying to sell the Daytona 5.7 for.  My Daytona 392 came with all the options too, I mean all of them.  I'm in love with the car!  The only thing I wish was different was the seats.  I think they could go a little lower to the floor."
    },
    "review23": {
        "metadata": {
            "Review_Title": "Looks+Power=Amazing vehicle for 40k",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Best power for the price. And it looks great."
    },
    "review24": {
        "metadata": {
            "Review_Title": "1st of many minivans!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " due To our growing family, we were in market for a minivan. After doing much research online, we went shopping. It took us 1 day to decide which van was right for us! 2017 Dodge Grand Caravan. I loved the look on the Chrysler Pacifica, so we drove on of those- we were not a big fan. It was not as comfortable as we thought a “luxury” minivan would be. We then drove the caravan- which was very smooth- absorbing bumps with ease, smooth acceleration, nice features, comfortable seats, and lower cost than the Pacifica. Granted, we did like the look of the interior dash in the Pacifica better- it did feel like you were driving a very large vehicle (and I drive a semi) we then drove the 2016 Kia Sedona, and our backs were hurting before we were finished with the test drive. We felt clostrophobic in the front of the Sedona. The Sedona is a bit longer than the caravan, but the front feels cramped, while there is a little more legroom in the back seats. We went into this shopping trip with 2 different vehicles in mind. The Pacifica, and the Sedona- we ended up liking the Dodge Grand Caravan so much more! Interior feels like it’s built to last, quality is great, design wonderful. *fyi- I’ve never been a fan of Dodge, but the stow-n-go option really made me consider it- I’m glad I did! One thing about the Caravan that is disappointing is the infotainment screen. Feels a bit like the screens from cell phones many years ago. Back up camera leaves much to be desired, as it is pretty grainy, and at night- it’s just about worthless. However, it is a touchscreen, and it is a decent size. The Sedona had a very small screen. If you can look past the quality of the screen, then definitely take a look at the 2017 Dodge Grand Caravan! Ours has leather/suede seats."
    },
    "review25": {
        "metadata": {
            "Review_Title": "My panda \"D\"",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " All shoppers out there, look for the best value for your dollar, don't allow unnecessary upgrades, extended warranties, you can get these items later on your own. Take time to decide what you want."
    },
    "review26": {
        "metadata": {
            "Review_Title": "My rt",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Pure fun to drive need to drive more"
    },
    "review27": {
        "metadata": {
            "Review_Title": "Super Race Technology",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " My 2017 Dodge Charger SRT is very exciting to own and drive. I think it's a great purchase for the person desiring performance."
    },
    "review28": {
        "metadata": {
            "Review_Title": "Like Disneyworld with no lines to wait in !",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " This is the most fun I ever had driving a car........I wish they made it when I was younger !"
    },
    "review29": {
        "metadata": {
            "Review_Title": "Very fast!!!!!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " If you purchase this car you want regreted."
    },
    "review30": {
        "metadata": {
            "Review_Title": "cool",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " gt package is the way to go,,,plenty of power, good fuel economy"
    },
    "review31": {
        "metadata": {
            "Review_Title": "BEST Vehicle EVER",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I bought the minivan for its space to haul my mobility scooter.  I installed a hoist and the scooter fits perfect.  I never use the last row of seating and carry a load of 400 lbs. at all times.  Looking at the van from the outside you can’t even tell it has anything inside.  I love the power and the sound of the engine when you put your foot into it. The start has a little lag but then it takes off like a rocket, I had a big SUV before which weighed 1500 lbs. more than the van and it had the same horse power and it would not get out of its own way. I live in Phoenix, AZ so the remote start is a must in the hot weather.  I start it when I get outside of the store and the time I get my scooter loaded and get in the driver seat the A/C has it cooled down.  The auto doors are the best for loading groceries don’t even have to get off my scooter.  I have people see me unloading my scooter and they always come over to help me close the rear door and I tell them it’s automatic and push the button.    The Bluetooth for the phone is great calling and receiving calls, I like music and was always shuffling cd’s in my old vehicle but this one puts them on the hard drive and then I never have to mess with them anymore. The mileage is good on the highway (26 MPG) in town I can’t keep my foot out of it so not that great, but that’s my own fault.  I’m 62 and have had a lot of vehicles and this by far is the best."
    },
    "review32": {
        "metadata": {
            "Review_Title": "Badass RT Plus Challenger",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " This is a cool car for a woman or a man.  I just happen to be a female so to me, if a man thinks your car is 'cool' then you have a stellar automobile.  The car is powerful and extremely comfortable.  I had an internal struggle to get an automatic with paddle shifts over a straight-up manual.  Believe me, I don't feel like I'm 'missing' anything.  I thoroughly enjoy the ride and since my car is loaded with goodies, I couldn't be happier with my choice considering the traffic to work and pleasure driving.  This car will impress your speakfreak friends and I'm sure your older relatives for pure comfort alone!"
    },
    "review33": {
        "metadata": {
            "Review_Title": "Dashing through the snow!!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I bought this car to be my daily driver, year 'round, when I'm not driving my import roadster.  I've already had several chances to drive in winter conditions and the car is flawless in wet, snowy, icy conditions.  The V-6 has plenty of power with 305HP.  So far I love everything about it and look forward to, I hope, many miles of service.  If Dodge made this model as a convertible my roadster might find itself a new owner."
    },
    "review34": {
        "metadata": {
            "Review_Title": "2017 R/T sedan",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Love this car !! can stay in it all day put it on the parkway it will do whatever you want it to do!! not the scat or hellcat but I'm very satisfied not crazy about the touch screen radio draws your attention away from the road not what you really want to do in this car also has kinda stiff ride but to be expected with a muscle car .Overall not dissapointed at all with what I spent"
    },
    "review35": {
        "metadata": {
            "Review_Title": "Bought a minivan for my puppy dogs",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " People think I'm crazy for purchasing a minivan to tote my dogs around, but it was the best of all options.  Low enough that they can get in and out as they grow older. Room enough that my German Shepherd is not slouching, or crammed in the back set.  it's perfect.  I put the 2nd row of Stow & Go seating down, dog beds on the floor, and we are ready to go."
    },
    "review36": {
        "metadata": {
            "Review_Title": "Get a CHALLENGER V8",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Car is awesome!!!"
    },
    "review37": {
        "metadata": {
            "Review_Title": "Such a great car for fun and commuting!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I traded in my 2015 Tacoma TRD Off Road for a 2017 SXT Plus. I LOVE IT!!! It handles amazingly and has such great acceleration. Throw it into sport mode and have even more fun with the paddle shifters. I have never been a fan of paddle shifters, but with this car, I make do! The ONLY complaint I have and thing I would change is the brakes feel much softer than I would like for such a high performance car. The only negative I have so far."
    },
    "review38": {
        "metadata": {
            "Review_Title": "Style, Storage and Squeal",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " We rented this model last year for a trip that required lots of storage room for the trip home. We were instantly converted to a minivan household! Due to an unfortunate accident (not our fault) in November, it did provide us with the opportunity to buy a new car. We didn’t even have to discuss it. We already knew what we wanted.  I searched online for a 2017nmodel, and bought it over the phone in less than an hour. When my husband’s workday ended, he dropped off our other car to have the brakes relined, and got a lift from a friend straight to Landmark in Athens. He drove our new car home after signing the paperwork. Great financing, great customer service! I am handicapped which makes entering and exiting a car difficult. But because the Grand Caravan sits lower than our crossover, it’s much easier for me know. Plus there is room for my wheelchair if needed. And the power out;ets allow me to use my medical while in transit so I can withstand longer road trips. So much storage space with all seats in position. If we stow all the seats, we can slide a queen size mattress and box springs in the back with room left over!  Love the separate temperatur controls in the front and rear. Rides like a car, storage room of a pickup and that v6 squeals the wheels when you have to go NOW. We weren’t picky...this was the last 2017 model left on the lot so we had no hcoice in color of van, carpet or rest of interior. Missing s power package we would like to have (seats, doors, tailgate), but otherwise it’s fabulous. And have you ever heard of getting 25mpg on surface streets? And we get 31mpg on the expressway. The economy fuel setting helps us achieve that. LOVE the Dodge Grand Caravan! And our rapidly growing teenager finally has room for his super long legs!  Cant say enough nice things about the car or Landmark Dodge. Just a great experience all the way around."
    },
    "review39": {
        "metadata": {
            "Review_Title": "2017 challenger sxt plus",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I'm 63 and have always wanted a Challenger....Worked for 43 yrs cutting meat for a living.. I am recently retired and this is my gift to myself... The car has been awesome, no problems and the dealership and salesman were outstanding to my wife and myself..Went on a little road trip and the car was quiet and tight and was really comfortable to be in.. The only thing I have to get use to his being careful when looking out the mirrors and the back when changing lanes...The view is restricted a bit and you just have to pay attention...Love the car and am looking forward to many years riding in style and comfort......  I have now had my Challenger for seven months and the review I gave when she was new, stands true today...Absolutely love the car, have had no problems with her at all.....The ride is still awesome, comfort and quality of the interior has been top notch... My wife is retiring this coming June and we are going to take the Challenger on the road and hope to see a good bit of this wonderful country...  Just a quick update on the ol' Challenger.....Still runs great, looks great, very comfortable....Have had one recall on it for a soft ware update and other than that we are good to go...Went up to Atlanta and back to Jacksonville with my son-in-law to pick his truck, as he and my daughter and their two kids have moved back from Kodiak Al......We ran between 75 and 80 on the interstate and got 31 mpg....."
    },
    "review40": {
        "metadata": {
            "Review_Title": "Great V6 but gas mileage is hard to obtain",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I leased a 2017 Dodge Challenger SXT. I wanted a challenger for many reasons but ultimately I was turned on by the 30mpg claim.  However, the only time I am able to get 30mpg is on the highway going down a hill.  I tried driving like a grandma for a day, super slow take offs and using several miles to accelerate to top speed but the best the computer showed was 25mpg.  And, that's terrible to drive like that, its way to slow and people were constantly going around me which indicated it was slower than a normal person would drive.  I have the high gloss black 20\" rims and the car has the 3.07 gears so maybe that's what's doing it but that's doubtful because at 70mph I'm under 2k RPMs and the instant tells me 22mpg.  So I don't know how they made that claim for 550 miles to the tankful but I have 500 miles on the car and have had to fill up twice already.  It leaves me wondering if I should of just got the R/T if I am going to get this bad of gas mileage but the dealership I went to didn't have an R/T on the lot. Next gripe was the GPS.  Sure it works as it should but its not Google (yes you can hook google up from your phone).   The stock GPS sent me on a 4.5 hour drive to get somewhere that's only 1 hour away.  I have no idea why it keeps telling me to get off the highway and then immediately get back on, it makes no sense.  So now I plug my phone in and only use Google GPS.  As far as driving it goes, it rides smooth and you can't feel it shifting which is pleasant.  Road nose is at a minimum.  Acceleration is what you would expect from a 3.6L, no big surprises there.  The trunk is huge, back seats are roomy.    As far as looking out of the car for blind-spots and other things, your visibility is great and I don't feel like there are any real danger zones around it. It is a big car but the only time it feels big is when I have to park it in a tight space, other than that it handles great and is a lot of fun to drive.  Overall, I wished I would of got the R/T for the extra power but I am happy with the lease and will more than likely turn it in for the R/T at the end of this 3 year lease."
    },
    "review41": {
        "metadata": {
            "Review_Title": "Awesome vehicle for the Price $$$$$$",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " First of all I hate minivans.  I can't stand the look of any of them.  I wonder why they just don't put sliding doors or SUV's but anyway.  I went to the dealership to get a family car with 3rd row seating.  The problem I have is that I have 2 babies and 2 elementary age kids and SUV's aren't to car seat friendly when it comes to space.  I must have looked through 10 SUV's.  Looked great on the outside but lacked what I needed on the inside.  My son was like \"want to check out the dodge grand caravan\" and I was like what other choice to I have.  He pulled around a black DGC SXT fully loaded.  auto start, power sliding doors, power rear door, sound system out of this world, Bluetooth, hands free calling, deep bass.  When I sat on the inside it had leather seating with suede.  I feel in love with the inside of the vehicle.  I like to feel a little manly in my vehicles and this dodge grand caravan gave me just what I needed.  I didn't want to look like a soccer mom.  With 280HP under the hood it doesn't hesitate one bit when stepping on the accelerator.  I was not expecting this van to peel out like it did.  I was shocked.  So then I took it on a handling test.  I drive a 2016 ford fusion 2.0 Turbo and I felt like I was driving my car around.  I got to keep my dude card and be able to take my entire family around of 6 people comfortably. I'm no minivan connoisseur and I'm sure to minivan enthusiast this may not be there first or second option.  But I see the new 2017 dodge grand caravan as a crossover minivan SUV combo.  For men that want that look and you know the look I'm taking about.  A vehicle that looks aggressive this minivan has great potential on the aftermarket just because it is a Dodge.  So when people look over at my minivan, they are confused.  It looks masculine and with 20\" pickup truck wheels it puts this vehicle in it's very own category that hasn't been touched.  Kind of like the Ford Flex."
    },
    "review42": {
        "metadata": {
            "Review_Title": "Why settle for a Ford, when you can buy a super do",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Always drive it, before you  buy it. Because you want buy a Ford. You drive a dodge.  You don't know what your missing. Great car. And handles nice. Great car all the way around.22"
    },
    "review43": {
        "metadata": {
            "Review_Title": "18 again",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " its fun to drive"
    },
    "review44": {
        "metadata": {
            "Review_Title": "My kick ass 2017 dodge challenger",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I knew exactly what I wanted when I purchased my dodge challenger.  I had been looking at the body style since it came back on the market in 2012. I had seen the reviews about it being difficult to see out of and the blind spots and how heavy the car was all the negative stuff. But I remember the dodge challenger form the the early 70's when it was a sexy beast of a muscle car. Then I saw the cars of the later 70's turned into big square blocks of metal and then all of the years of seeing the Honda and the Toyota's rule the road. So when American Muscle started showing back up (even American Muscle made by a french Company out of Mexican Parts in Canada) I got excited. When I finally saw my 2017 challenger with the scat pack, in Yellow Jacket Yellow with black tail stripes and leather interior. I had to have to it. From the moment that I pushed the start button and heard that 6.4 liter rumble to life I got a permanent smile on my face. Since I learned how to drive in the 60's I knew how to adjust my mirrors to eliminate blind spots. You can push the sports mode button and the steering stiffens up enough that you can feel the road properly. The active exhaust sounds so freakin' good that you find your self tuning down the 650 watt alpine sound system to listen to the engines music.  The uconnect is intuitive and it almost links your devices to itself. The performance pages give you the option of seeing detailed workings of your car as you cruise and the timers let you keep track of your performance. Plus the launch control and the the programmable features that allow you change the way the car shifts, the stiffness of the steering and other controls makes the care flexible for various conditions.  I didn't buy this car hoping for any kind of fuel economy, hell I don't care if everytime that I push the start button someone goes out on the tundra and clubs a baby seal to death. I bought this car because it is a beautiful evil wicked beast that is fun to drive and it makes me happy. If you buy one of these cars for any reason other than that then you will most likely end up bitching and whining about something. If you are a skinny jean wearing half caff/decaff latte drinker you won't like this car. But if you like to feel the road, hear the rumble of an engine, and feel the g-forces push you back in the seat then this is your dream car"
    },
    "review45": {
        "metadata": {
            "Review_Title": "Super fast, super fun!!!",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Fastest car I've ever driven. A ton of fun and great looking with old-school design. Glad I bought it."
    },
    "review46": {
        "metadata": {
            "Review_Title": "This is the car you wanted when you bought the 5.7",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " This is a whole new world of driving. Forget about gas mileage. You will automatically become 18 years old again. Drive this before you buy the 5.7. It's worth the extra money. Plenty of used ones around to save some cash. Dealer incentives if you want new. Sport Mode will probably turn this into an interstellar space ship, haven't tried it yet. I purchased a 1970 Dodge Dart 340 in 1970 which was fast. This car is faster. Exhaust rumble will wake you up.  This is a mini Hellcat with more power than you will ever need.  Crazy fast."
    },
    "review47": {
        "metadata": {
            "Review_Title": "Dodge Grand Caravan",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Great practical vehicle.  Love the stow and go storage under the floor and radio with hard drive for my music.  Has front and rear heated seats and USB ports.  Kids love it!"
    },
    "review48": {
        "metadata": {
            "Review_Title": "SRT 392 Six Speed Manual",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " I absolutely love this car. It's my \"drive on sunny days and sunny weekends\" only car. Great power, acceleration, braking, handling and looks! Yes, it's a heavy car but it has more than enough power and handles fine for a car of it's weight. Visibility is good from the inside and the tech features are state of the art. The six speed manual is smooth most of the time but it can be a bit clunky and temperamental at times. That might just be the driver though. The only negative I have about the car is the insane amount of brake dust coming from the Brembo brakes. I wash the car and clean the wheels and within 20 miles the wheels are covered with dust and darker than the rear wheels. It wipes right off but it's a pain. GREAT MUSCLE CAR!!!"
    },
    "review49": {
        "metadata": {
            "Review_Title": "my child hood dream",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " WOW!!!! just push that button to start, you hear the growl. goose bumps start up your arm, then stick it in gear and hit that 392 hemi and poof you are gone, this thing is a beast, sport mode is unreal and fun to drive , I had a 5.7 Challenger was a sissy to this beast."
    },
    "review50": {
        "metadata": {
            "Review_Title": "Very 😃",
            "Rating": 5.0,
            "Vehicle_Year": 2017,
            "Vehicle_Model": "Dodge"
        },
        "review": " Very  pleased! Great deal! So far so good!"
    }
}